Долома/src/Catalogs/РодословнаяЖивотных/РодословнаяЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РодословнаяЖивотных</name>
  <attributes>
    <name>Отец</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
  <attributes>
    <name>Мать</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>Кличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КличкаНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейнаяПринадлежность</name>
    <type>
      <types>CatalogRef.Линии</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>Породность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомплексныйКласс</name>
    <type>
      <types>CatalogRef.КомплексныеКлассы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Масть</name>
    <type>
      <types>CatalogRef.Масти</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСемени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БиркаХорриот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БетаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаппаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Долома/src/Catalogs/РодословнаяЖивотных/ManagerModule.bsl
&НаСервере
Функция ПолучитьПоляЗаполнения() Экспорт
	
	МассивПолейЗаполнения = Новый Массив;
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Пол");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Пол (NPOL)");
	//СтруктураДанных.Вставить("Тип", 					Тип("ПеречислениеСсылка.ПолЖивотного"));
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"РядРодословной");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Ряд родословной (NN)");
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ИдентификационныйНомер");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Идентификационный номер (NANIMAL)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Кличка");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Кличка (KLICHKA)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Истина);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Порода");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Порода (NPOR)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Породы"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Линия");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Линия (NLIN)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Линии"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Породность");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Породность (NPORDN)");
	//СтруктураДанных.Вставить("Тип", 					Тип("Булево"));
	СтруктураДанных.Вставить("Тип", 					Тип("Число"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КомплексныйКласс");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Комплексный класс (NKKLASS)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.КомплексныеКлассы"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"СтранаПроисхождения");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Страна происхождения (NGOS_EXPORT)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.СтраныМира"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"ДатаРождения");
	СтруктураДанных.Вставить("ИмяКолонки", 				"дата рождения (DATE_ROGD)");
	СтруктураДанных.Вставить("Тип", 					Тип("Дата"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"НомерОтца");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Номер отца (NOTCA)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"НомерМатери");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Номер матери (NMATERI)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"РегистрационныйНомер");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Регистрационный номер (NIDENT_OLD)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"Масть");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Масть (NMAST)");
	СтруктураДанных.Вставить("Тип", 					Тип("СправочникСсылка.Масти"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КодСемени");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Код семени (OSEMKOD)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КаппаКазеин");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Каппа-казеин (DNKVALUE1)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"БетаКазеин");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Бета-казеин (DNKVALUE4)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Имя", 					"КличкаНаАнглийском");
	СтруктураДанных.Вставить("ИмяКолонки", 				"Кличка на английском (ENGNAME)");
	СтруктураДанных.Вставить("Тип", 					Тип("Строка"));
	СтруктураДанных.Вставить("ОбязательноеПоле", 		Ложь);
	МассивПолейЗаполнения.Добавить(СтруктураДанных);
	
	Возврат МассивПолейЗаполнения;
	
КонецФункции
